namespace HashTableConsoleApp
{
    public static class LiteratureData
    {
        public static readonly List<(string, string)> Data = new()
        {
            ("Герой", "Центральный персонаж литературного произведения, обладающий особыми качествами и играющий ключевую роль в сюжете"),
            ("Мотив","Возникающая в произведении тема или идея, которая повторяется и служит стимулом для развития сюжета или характеров"),
            ("Сюжет","Структура событий и действий, описанных в литературном произведении, обеспечивающая его хронологическую последовательность"),
            ("Персонаж","Литературный образ, обладающий определенными чертами характера, мотивами и действиями, созданный автором произведения"),
            ("Тема","Основная идея или концепция, затрагиваемая в литературном произведении и развиваемая через его сюжет и персонажей"),
            ("Жанр","Определенная форма или стиль литературного произведения, определяемая его характеристиками и тематикой"),
            ("Поэзия","Литературный жанр, использующий метафоры, ритм и образы для выражения эмоций и идей"),
            ("Роман","Произведение длинного объема, в котором описывается разнообразная сюжетная линия и развитие персонажей"),
            ("Стих","Организованная форма литературного текста, обладающая метрической структурой и ритмическими особенностями"),
            ("Символ","Образ, предмет или явление, используемое для представления абстрактных идей или концепций в литературном произведении"),
            ("Аллегория","Литературный прием, при котором символы или образы используются для передачи скрытого смысла или аллегории"),
            ("Эпос","Длинное поэтическое произведение, рассказывающее о героических подвигах и легендах народа или отдельных героев"),
            ("Драма","Литературный жанр, представленный в виде сценического произведения, где действие разворачивается через диалоги персонажей"),
            ("Конфликт","Столкновение интересов, целей или мировоззрений, являющееся движущей силой сюжета в литературном произведении."),
            ("Ирония","Литературный прием, при котором автор или персонаж выражает мысли или действия, противоположные их фактическому смыслу или ожиданиям читателя"),
            ("Опера","Музыкально-театральный жанр, где действие развивается через музыкальные номера и диалоги"),
            ("Эссе","Жанр литературного произведения, представляющий собой авторское эссе или рассуждение на определенную тему"),
            ("Автобиография","Литературное произведение, основанное на реальных событиях и переживаниях автора, рассказывающее о его собственной жизни"),
            ("Антигерой","Литературный персонаж, отличающийся от традиционного героя негативными качествами или действиями"),
            ("Экспозиция","Часть сюжета, представляющая основную информацию о персонажах, их отношениях и контексте произведения"),
            ("Катарсис","Эмоциональное очищение или освобождение, вызванное интенсивным переживанием художественного произведения"),
            ("Лирика","Литературный жанр, в котором автор выражает свои эмоции, чувства и мысли, часто в форме стихов или песен"),
        };
    }
}
